app/views/ideas/showIdea.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 1]]
---
										<% end %>
										<% comment.child_comments.each do |child| %>