app/controllers/ideas_controller.rb

  def showAll
    # These are instance variables, which can be used in the views
    # This is how we display all the Idea(s) in the index view
  	@all_ideas = Idea.all.page(params[:page]).per(12)
---
SELECT  "ideas".* FROM "ideas" LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "ideas"

  def showIdea
    @new_idea = Idea.new
    @idea = Idea.find(params[:id])
		@comments = @idea.comments.all
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 1]]

  def showBMC
    @idea = Idea.find(params[:id])
    @stickies = @idea.stickies.all
    @sticky = @idea.stickies.build

    # THIS SEEMS LIKE A BAD IDEA? HOW ELSE CAN THIS BE IMPLEMENTED??
    @keyPartners = @stickies.where(:section => "Key Partners")
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
SELECT "stickies".* FROM "stickies" WHERE "stickies"."idea_id" = ? AND "stickies"."section" = ?  [["idea_id", 1], ["section", "Key Partners"]]

  def delete
    # http://stackoverflow.com/questions/18682914/passing-id-to-controller-through-link-to-in-railsner
    @deleteIdea = Idea.find(params[:id]).delete

    if @deleteIdea.save
      current_user.createActivity(@deleteIdea, "deleted")
---
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 2]]
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "activities" ("user_id", "targetable_id", "targetable_type", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["targetable_id", 2], ["targetable_type", "Idea"], ["action", "deleted"], ["created_at", "2015-04-30 21:35:19.278255"], ["updated_at", "2015-04-30 21:35:19.278255"]]

  def add
    # THIS CANT BE RIGHT...
  	@idea = Idea.create(
      :name => params[:idea][:name],
      :author => current_user.profileName,
      :valueProposition => params[:idea][:valueProposition],
      :customerSegment => params[:idea][:customerSegment],
      :marketSize => params[:idea][:marketSize],
      :resources => params[:idea][:resources],
      :stage => params[:idea][:stage],
      :vision => params[:idea][:vision],
      :sector => params[:idea][:sector],
      :description => params[:idea][:description],
      :picture =>params[:idea][:picture]
    )

    if @idea.save
      current_user.createActivity(@idea, "created")
---
INSERT INTO "ideas" ("name", "author", "valueProposition", "customerSegment", "marketSize", "resources", "stage", "vision", "sector", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "activities" ("user_id", "targetable_id", "targetable_type", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["targetable_id", 1], ["targetable_type", "Idea"], ["action", "created"], ["created_at", "2015-04-27 01:37:57.206504"], ["updated_at", "2015-04-27 01:37:57.206504"]]

  def editIdea
    @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @idea = Idea.find(params[:id])
    #idea_params = @idea.params
    if @idea.update_attributes(idea_params)
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "ideas" SET "name" = ?, "description" = ?, "customerSegment" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "Melissa's Idea2"], ["description", "Melissa's Description2"], ["customerSegment", "Melissa's Customer Segment2"], ["updated_at", "2015-04-30 21:17:46.482616"], ["id", 2]]