app/controllers/profiles_controller.rb

  def showProfile
  	@user_byName = User.find_by_profileName(params[:id]) 						# RETURNS USER OBJECT: NOTE NOT THE ID
  	@user_comments = Comment.where(:user_id => @user_byName.id)
  	@user_ideas = Idea.where(:author => @user_byName.profileName).page(params[:page]).per(6)
  	@user_friendships = @user_byName.user_friendships.all
---
SELECT  "users".* FROM "users" WHERE "users"."profileName" = ? LIMIT 1  [["profileName", "mmcneill"]]
SELECT COUNT(*) FROM "ideas" WHERE "ideas"."author" = ?  [["author", "mmcneill"]]
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."author" = ? LIMIT 8 OFFSET 0  [["author", "mmcneill"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "user_friendships"."id" FROM "user_friendships" WHERE "user_friendships"."user_id" = ? AND "user_friendships"."friend_id" = ?  [["user_id", 1], ["friend_id", 1]]